# CannotSwapNestedGroups Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..GroupFailures..::..CannotSwapNestedGroups Property
BuiltInFailures..::..GroupFailures Class See Also
---
Can't replace because one Group is contained in the other.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId CannotSwapNestedGroups { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property CannotSwapNestedGroups As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ CannotSwapNestedGroups {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..GroupFailures Class
Autodesk.Revit.DB Namespace